SELECT USER
FROM DUAL;
--==>> SCOTT



SELECT *
FROM TBL_출고;
--==>> 1	H001	2022-09-02	100	1000

SELECT *
FROM TBL_상품;

/*
C001	구구콘	    1500	30  ◀
C002	월드콘	    1500	30  ◀
C003	브라보콘	    1300	0
C004	누가콘	    1800	0
C005	슈퍼콘	    1900	0
H001	스크류바	    1000	0
H002	캔디바	    300	100 ◀
H003	쌍쌍바	    500	0
H004	돼지바	    600	0
H005	메로나	    500	0
E001	찰떡아이스	2500	0
E002	붕어싸만코	2000	0
E003	빵또아	    2300	0
E004	거북알	    2300	0
E005	쿠키오	    2400	0
E006	국화빵	    2000	0
E007	투게더	    3000	0
E008	엑설런트	    3000	0
E009	셀렉션	    3000	0
*/


SELECT *
FROM TBL_입고;
-- 전

/*
입고번호   상품코드 입고일자    입고수량 입고단가
1	        C001    	2022-09-02	30	    1200
2	        C002	    2022-09-02	30	    1200
3	        H001	    2022-09-02	50	    800
4	        H002	    2022-09-02	50	    200
5	        H001	    2022-09-02	50	    800
6	        H002	    2022-09-02	50	    200
*/
-- 1. PRC_입고_UPDATE(입고번호, 입고수량)


EXEC PRC_입고_UPDATE(6,20);
--==>> PL/SQL 프로시저가 성공적으로 완료되었습니다.
EXEC PRC_입고_UPDATE(1,50);
--==>> PL/SQL 프로시저가 성공적으로 완료되었습니다.
/*
C001	구구콘	1500	50
C002	월드콘	1500	30
C003	브라보콘	1300	0
C004	누가콘	1800	0
C005	슈퍼콘	1900	0
H001	스크류바	1000	100
H002	캔디바	300	70
H003	쌍쌍바	500	0
H004	돼지바	600	0
H005	메로나	500	0
E001	찰떡아이스	2500	0
E002	붕어싸만코	2000	0
E003	빵또아	2300	0
E004	거북알	2300	0
E005	쿠키오	2400	0
E006	국화빵	2000	0
E007	투게더	3000	0
E008	엑설런트	3000	0
E009	셀렉션	3000	0
*/


SELECT *
FROM TBL_상품;



SELECT *
FROM TBL_입고;

-- 후
/*
입고번호   상품코드 입고일자    입고수량 입고단가
1	        C001    	2022-09-02	30	    1200
2	        C002	    2022-09-02	30	    1200
3	        H001	    2022-09-02	50	    800
4	        H002	    2022-09-02	50	    200
5	        H001	    2022-09-02	50	    800
6	        H002	    2022-09-02	20	    200  ◀
*/

-- 2. PRC_입고_DELETE(입고번호)  

 EXEC PRC_입고_DELETE(2);
--==>> PL/SQL 프로시저가 성공적으로 완료되었습니다.
/*
C001	구구콘	    1500	1
C002	월드콘	    1500	30
C003	브라보콘	    1300	0
C004	누가콘	    1800	0
C005	슈퍼콘	    1900	0
H001	스크류바	    1000	0
H002	캔디바	    300	70
H003	쌍쌍바	    500	0
H004	돼지바	    600	0
H005	메로나	    500	0
E001	찰떡아이스	2500	0
E002	붕어싸만코	2000	0
E003	빵또아	    2300	0
E004	거북알	    2300	0
E005	쿠키오	    2400	0
E006	국화빵	    2000	0
E007	투게더	    3000	0
E008	엑설런트	    3000	0
E009	셀렉션	    3000	0
*/



SELECT *
FROM TBL_상품;


--  3. PRC_출고_DELETE(출고번호) 
EXEC PRC_출고_DELETE(1);
--==>> PL/SQL 프로시저가 성공적으로 완료되었습니다.


SELECT *
FROM TBL_상품;
--==>> H001	스크류바	1000	100


SELECT *
FROM TBL_출고;
 --==>> 1	H001	2022-09-02	100	1000
 
SELECT *
FROM TBL_입고;
/*
1	C001	2022-09-02	1	1200
2	C002	2022-09-02	30	1200
3	H001	2022-09-02	50	800
4	H002	2022-09-02	50	200
5	H001	2022-09-02	50	800
6	H002	2022-09-02	20	200
*/

